Examinator/src/Catalogs/ПубликацииВебКабинетаСУ/ПубликацииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПубликацииВебКабинетаСУ</name>
  <attributes>
    <name>АдресВебСервера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликацииИБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликацийРесурсов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКаталогаКабинета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКаталогаФайлов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКаталогаКартинок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЛоготипа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СлужебныйПользовательУказанВПубликацииИнформационнойБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинСлужебногоПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСлужебногоПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНовостиСтарее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаПользователи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаЭР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВебСервисаЭР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаЭлектронныхКурсов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаСвободнаяРегистрация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтраницыРегистрации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноВосстановлениеПароля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтраницыВосстановленияПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаСтандартнаяАутентификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаАутентификацияCAS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервераCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервисаCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИконкаСервераCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенСписокОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенКалендарьОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытоеОбучение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныРезультатыОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныСертификатыОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтатусОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаКарточкаОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантКалендаря</name>
    <type>
      <types>EnumRef.ВариантыКалендаряВебКабинетаСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаОтправкаЛичныхСообщенийИзКарточкиПользователя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьЭлектронныеРесурсыОбученияВНовомОкне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьЭлементыБиблиотекиВНовомОкне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКоличествоЭлементовРазделаБиблиотеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРолиПреподавателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПользователейОнлайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПользователейОнлайнВМеню</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПинКодыДляРегистрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаАутентификацияOpenID</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПровайдераOpenID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПровайдераOpenID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменятьАутентификациюПровайдераOpenIDПриВыходе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьАутентификациюПровайдераOpenIDПослеЗагрузкиСтраниц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПоискПоЭлектроннымРесурсам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Язык</name>
    <type>
      <types>EnumRef.ЯзыкиВебКабинетаСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенРазделПроверкиЗаданий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НижнийКолонтитул</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенПолныйКаталогПользователей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЕдинственнаяПубликацияВОбщемКаталоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>EnumRef.РедакцииВебКабинетаСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикЯндексМетрики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСервисаSentry</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСведенияВКонсоль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенноеЧислоМинутНеактивности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьПинКодыНаГлавнойСтранице</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаСбораСтатистики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПоляИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПоляИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбразецЗаполненияПоляИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазместитьСсылкуРегистрацииСверху</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьФотографиюПрофиля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьКонтактнуюИнформациюВПрофиле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьДополнительнуюИнформациюВПрофиле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьНастройкиРассылокВПрофиле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаОтзывОтветаНаЗадание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОформлениеКомандыПрофиля</name>
    <type>
      <types>EnumRef.ВариантыОформленияКомандыПрофиляВебКабинетаСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытиеОтчетаВФорматеPDF</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытиеОтчетаВФорматеExcel</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытиеОтчетаВКабинете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключитьОтчеты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенПолныйСписокОтчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьПустыеПапкиБиблиотеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Иконка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страница</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Якорь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступенПублично</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступенПослеАвторизации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроверятьПрава</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоляРегистрации</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>EnumRef.ВидыПолейРегистрацииВебКабинетаСУО</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоля</name>
      <type>
        <types>EnumRef.ТипыПолейРегистрацииВебКабинетаСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактнаяИнформация</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавлятьПолеПодтверждения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПодтверждения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьКакЛогин</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазмещениеОтчетов</name>
    <attributes>
      <name>Отчет</name>
      <type>
        <types>CatalogRef.ВариантыОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размещение</name>
      <type>
        <types>EnumRef.ВариантыРазмещенияОтчетовВебКабинетаСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппировкиОбучений</name>
    <attributes>
      <name>Группировка</name>
      <type>
        <types>EnumRef.ГруппировкиОбученийВебКабинетаСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование_ru</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование_en</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/РедакцииВебКабинетаСУ/РедакцииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РедакцииВебКабинетаСУ</name>
  <enumValues>
    <name>Редакция20</name>
  </enumValues>
  <enumValues>
    <name>Редакция30</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ПубликацииВебКабинетаСУ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;			
	
	Если ЭтоЕдинственнаяПубликацияВОбщемКаталоге Тогда
		
		// Проверяем соединение с базой
		
		ОшибкаСоединения = ОбщегоНазначенияСУ.ПроверитьСоединениеСБазой();
		Если ЗначениеЗаполнено(ОшибкаСоединения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОшибкаСоединения);
		КонецЕсли;
		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Редакция) Тогда
		Редакция = ВебКабинетСУ.Редакция();
	КонецЕсли;
	
	Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		АдресКаталогаКартинок = "";
	КонецЕсли;
	
	Если НЕ СлужебныйПользовательУказанВПубликацииИнформационнойБазы Тогда
		ПодключитьОтчеты = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;			
	
	Если ДополнительныеСвойства.Свойство("ИспользоватьПоУмолчанию")
		И ДополнительныеСвойства.ИспользоватьПоУмолчанию Тогда
		
		ВебКабинетСУ.УстановитьОсновнуюПубликацию(Ссылка);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Строка Из ПоляРегистрации Цикл
	
		Если ТипЗнч(Строка.Имя) = Тип("Строка")
			И НЕ ЗначениеЗаполнено(Строка.КонтактнаяИнформация)
			И НЕ ЗначениеЗаполнено(Строка.Реквизит) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Если поле регистрации определено строкой,
				|то необходимо указать реквизит или вид контактной информации,
				|в которое будет помещено значение поля.'"),
				,
				"Объект.ПоляРегистрации[" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Строка.НомерСтроки - 1) + "].Имя",
				,
				Отказ
			);
				
		КонецЕсли;
		
		Если ТипЗнч(Строка.Имя) = Тип("ПеречислениеСсылка.ВидыПолейРегистрацииВебКабинетаСУО")
			И (ЗначениеЗаполнено(Строка.КонтактнаяИнформация)
			ИЛИ ЗначениеЗаполнено(Строка.Реквизит)) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Если поле регистрации определено типом,
				|то нельзя указывать реквизит или вид контактной информации'"),
				,
				"Объект.ПоляРегистрации[" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Строка.НомерСтроки - 1) + "].Имя",
				,
				Отказ
			);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.КонтактнаяИнформация)
			И ЗначениеЗаполнено(Строка.Реквизит) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Нельзя указывать реквизит и вид контактной информации одновременно'"),
				,
				"Объект.ПоляРегистрации[" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Строка.НомерСтроки - 1) + "].КонтактнаяИнформация",
				,
				Отказ
			);
			
		КонецЕсли;
		
		Если Строка.ДобавлятьПолеПодтверждения
			И НЕ ЗначениеЗаполнено(Строка.НаименованиеПодтверждения) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Укажите наименование поля подтверждения'"),
				,
				"Объект.ПоляРегистрации[" + ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Строка.НомерСтроки - 1) + "].НаименованиеПодтверждения",
				,
				Отказ
			);
			
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ЗаполнитьАвтоматическуюПубликацию() Экспорт
	
	// Получаем переменные
	
	АдресБазы = ОбщегоНазначенияСУ.АдресИнформационнойБазы();
	СтруктураАдресаБазы = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресБазы);	
	
	АдресОбщегоКаталога =  ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Константы.АдресОбщегоКаталогаСУ.Получить());
	СтруктураАдресаОбщегоКаталога = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресОбщегоКаталога);	
	
	Если СтруктураАдресаБазы.Схема <> СтруктураАдресаОбщегоКаталога.Схема Тогда		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Различаются схемы общего каталога и адреса базы: %1 не равно %2'"), СтруктураАдресаБазы.Схема, СтруктураАдресаОбщегоКаталога.Схема);		
	КонецЕсли;		
	
	Если СтруктураАдресаБазы.ИмяСервера <> СтруктураАдресаОбщегоКаталога.ИмяСервера Тогда		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Различаются имена сервера общего каталога и адреса базы: %1 не равно %2'"), СтруктураАдресаБазы.ИмяСервера, СтруктураАдресаОбщегоКаталога.ИмяСервера);		
	КонецЕсли;	
	
	Если Найти(АдресОбщегоКаталога, "?") > 0 ИЛИ Найти(АдресОбщегоКаталога, "#") > 0 Тогда
		ВызватьИсключение НСтр("ru = 'Адрес общего каталога не должен содержать знаков ? или #'");
	КонецЕсли;
	
	Если Найти(АдресБазы, "?") > 0 ИЛИ Найти(АдресБазы, "#") > 0 Тогда
		ВызватьИсключение НСтр("ru = 'Адрес базы не должен содержать знаков ? или #'");
	КонецЕсли;	
	
	// Заполняем реквизиты
	
	Если ЭтоНовый() Тогда
		
		Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
			Наименование = НСтр("ru = 'Основная публикация'");
		Иначе
			Наименование = НСтр("ru = 'Электронное обучение'");
		КонецЕсли;
		
		ЭтоЕдинственнаяПубликацияВОбщемКаталоге = Истина;
		
		МассивАвтоРеквизитов = Новый Массив;
		МассивАвтоРеквизитов.Добавить("СкрыватьНовостиСтарее");
		МассивАвтоРеквизитов.Добавить("ДоступнаСвободнаяРегистрация");
		МассивАвтоРеквизитов.Добавить("ДоступноВосстановлениеПароля");
		МассивАвтоРеквизитов.Добавить("ДоступнаСтандартнаяАутентификация");
		МассивАвтоРеквизитов.Добавить("ДоступенСписокОбучения");
		МассивАвтоРеквизитов.Добавить("ДоступенКалендарьОбучения");
		МассивАвтоРеквизитов.Добавить("ДоступноОткрытоеОбучение");
		МассивАвтоРеквизитов.Добавить("ДоступныРезультатыОбучения");
		МассивАвтоРеквизитов.Добавить("ДоступныСертификатыОбучения");
		МассивАвтоРеквизитов.Добавить("ПоказыватьСтатусОбучения");
		МассивАвтоРеквизитов.Добавить("ДоступнаКарточкаОбучения");
		МассивАвтоРеквизитов.Добавить("ВариантКалендаря");
		МассивАвтоРеквизитов.Добавить("ДоступнаОтправкаЛичныхСообщенийИзКарточкиПользователя");
		МассивАвтоРеквизитов.Добавить("ОткрыватьЭлектронныеРесурсыОбученияВНовомОкне");
		МассивАвтоРеквизитов.Добавить("ОткрыватьЭлементыБиблиотекиВНовомОкне");
		МассивАвтоРеквизитов.Добавить("ПоказыватьКоличествоЭлементовРазделаБиблиотеки");
		МассивАвтоРеквизитов.Добавить("СтартоваяСтраница");
		МассивАвтоРеквизитов.Добавить("ПоказыватьРолиПреподавателей");
		МассивАвтоРеквизитов.Добавить("ПоказыватьПользователейОнлайн");
		МассивАвтоРеквизитов.Добавить("ПоказыватьПользователейОнлайнВМеню");
		МассивАвтоРеквизитов.Добавить("ИспользоватьПинКодыДляРегистрации");
		МассивАвтоРеквизитов.Добавить("Язык");
		МассивАвтоРеквизитов.Добавить("ДоступенРазделПроверкиЗаданий");
		МассивАвтоРеквизитов.Добавить("ДоступенПолныйКаталогПользователей");
			
		ЗаполнитьРеквизитыЗначениемЗаполнения(МассивАвтоРеквизитов);
			
		Справочники.ПубликацииВебКабинетаСУ.ЗаполнитьОбъектНачальнымиДанными(ЭтотОбъект);		
		
	КонецЕсли;
	
	АдресВебСервера = СтруктураАдресаБазы.Схема + "://" + СтруктураАдресаБазы.ИмяСервера;
	АдресПубликации = "/" + ОбщегоНазначенияСУКлиентСервер.УбратьКонечныйРазделительПути(СтруктураАдресаОбщегоКаталога.ПутьНаСервере);
	АдресПубликацииИБ = "/" + ОбщегоНазначенияСУКлиентСервер.УбратьКонечныйРазделительПути(СтруктураАдресаБазы.ПутьНаСервере);
	АдресПубликацийРесурсов = АдресПубликации + "/" + ЭлектронныеРесурсыСУЗКлиентСервер.ИмяКаталогаЭлектронныхРесурсов();
	АдресКаталогаКабинета =  ОбщегоНазначенияСУКлиентСервер.УбратьКонечныйРазделительПути(ВебКабинетСУ.ПутьККаталогуУстановки(АдресПубликации));
	
	Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30 Тогда
		АдресКаталогаКартинок = ОбщегоНазначенияСУКлиентСервер.УбратьКонечныйРазделительПути(ВебКабинетСУ.ПутьККаталогуКартинок(АдресПубликации));
	Иначе
		АдресКаталогаКартинок = "";
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		АдресКаталогаФайлов = "";
	КонецЕсли;
	
	АдресСервисаОбучения =  АдресПубликацииИБ + "/hs/cabinet";
	АдресСервисаПользователи = АдресПубликацииИБ + "/hs/users";
	АдресСервисаЭР = АдресПубликацииИБ + "/hs/res";
	АдресСервисаЭлектронныхКурсов = АдресПубликацииИБ + "/hs/courses";
	АдресВебСервисаЭР = АдресПубликацииИБ + "/ws/res.1cws";
	
	СлужебныйПользовательУказанВПубликацииИнформационнойБазы = Константы.СлужебныйПользовательУказанВПубликацииСУ.Получить();
	Если СлужебныйПользовательУказанВПубликацииИнформационнойБазы Тогда
		ЛогинСлужебногоПользователя = "";
		ПарольСлужебногоПользователя = "";
	Иначе
		ЛогинСлужебногоПользователя = ОбщегоНазначенияСУ.ЛогинИПарольСлужебногоПользователяДляСоединенияСБазой();
		ПарольСлужебногоПользователя = ОбщегоНазначенияСУ.ЛогинИПарольСлужебногоПользователяДляСоединенияСБазой();		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыЗначениемЗаполнения(МассивРеквизитов)
	
	РеквизитыСправочника = Метаданные.Справочники.ПубликацииВебКабинетаСУ.Реквизиты;
	
	Для каждого ИмяРеквизитаСтрока Из МассивРеквизитов Цикл
		ЭтотОбъект[ИмяРеквизитаСтрока] = РеквизитыСправочника[ИмяРеквизитаСтрока].ЗначениеЗаполнения;
	КонецЦикла;	
	
КонецПроцедуры

Функция НастройкиДействующиеТолькоВРедакции30()
	
	МассивНастроек = Новый Массив;
	МассивНастроек.Добавить("РазрешенноеЧислоМинутНеактивности");
	МассивНастроек.Добавить("ЧастотаСбораСтатистики");
	МассивНастроек.Добавить("ВыводитьСведенияВКонсоль");
	
	Возврат МассивНастроек;
	
КонецФункции

Процедура ЗаписатьФайлНастроек() Экспорт
	
	// Процедуру следует запускать в одной транзакции с записью публикации,
	// но не в обработчиках, так как в этом случае ошибка после записи в транзакции
	// файла настроек не приведет к откату уже записанного файла, но приведет к откату
	// записи настроек публикации.
	
	Если НЕ ЭтоЕдинственнаяПубликацияВОбщемКаталоге Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиТолькоВРедакции30 = НастройкиДействующиеТолькоВРедакции30();
	
	Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		
		Публикация30 = Справочники.ПубликацииВебКабинетаСУ.ОсновнаяПубликация(Перечисления.РедакцииВебКабинетаСУ.Редакция30);
		
		Если ЗначениеЗаполнено(Публикация30) Тогда
			Для каждого ИмяНастройки30 Из НастройкиТолькоВРедакции30 Цикл
				ЭтотОбъект[ИмяНастройки30] = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Публикация30, ИмяНастройки30);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	ПутьДляЗаписиФайлаНастроек = Константы.ПутьКОбщемуКаталогуСУ.Получить();
	ПутьДляЗаписиФайлаНастроек = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьДляЗаписиФайлаНастроек);
	ПутьДляЗаписиФайлаНастроек = ПутьДляЗаписиФайлаНастроек + ВебКабинетСУ.ИмяФайлаНастроек();
	
	Справочники.ПубликацииВебКабинетаСУ.СформироватьФайлНастроек(ЭтотОбъект,,ПутьДляЗаписиФайлаНастроек);	
	
	Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30
		И НЕ Справочники.ПубликацииВебКабинетаСУ.ЕстьПубликацииРедакции(Перечисления.РедакцииВебКабинетаСУ.Редакция20) Тогда
		
		// Файл настроек старой версии нужен для просмотра электронных курсов,
		// поэтому если его нет, то создаем.
		
		ПутьДляЗаписиФайлаНастроек = Константы.ПутьКОбщемуКаталогуСУ.Получить();
		ПутьДляЗаписиФайлаНастроек = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьДляЗаписиФайлаНастроек);
		ПутьДляЗаписиФайлаНастроек = ПутьДляЗаписиФайлаНастроек + ВебКабинетСУ.ИмяФайлаНастроек(Перечисления.РедакцииВебКабинетаСУ.Редакция20);		
		
		ЭтотОбъект.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20;
		Справочники.ПубликацииВебКабинетаСУ.СформироватьФайлНастроек(ЭтотОбъект,,ПутьДляЗаписиФайлаНастроек);
		ЭтотОбъект.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30;
		
	КонецЕсли;
	
	Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		
		// Обновляем файл настроек третьей редакции, так как ее настройки зависят от второй.
		
		Публикация30 = Справочники.ПубликацииВебКабинетаСУ.ОсновнаяПубликация(Перечисления.РедакцииВебКабинетаСУ.Редакция30);
		
		Если ЗначениеЗаполнено(Публикация30) Тогда
			ПутьДляЗаписиФайлаНастроек = Константы.ПутьКОбщемуКаталогуСУ.Получить();
			ПутьДляЗаписиФайлаНастроек = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьДляЗаписиФайлаНастроек);
			ПутьДляЗаписиФайлаНастроек = ПутьДляЗаписиФайлаНастроек + ВебКабинетСУ.ИмяФайлаНастроек(Перечисления.РедакцииВебКабинетаСУ.Редакция30);		
			Публикация30Объект = Публикация30.ПолучитьОбъект();
			Справочники.ПубликацииВебКабинетаСУ.СформироватьФайлНастроек(Публикация30Объект,,ПутьДляЗаписиФайлаНастроек);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30 Тогда
		
		// Обновляем файл настроек второй редакции, так как ее настройки зависят от третьей.
		
		Публикация20 = Справочники.ПубликацииВебКабинетаСУ.ОсновнаяПубликация(Перечисления.РедакцииВебКабинетаСУ.Редакция20);
		
		Если ЗначениеЗаполнено(Публикация20) Тогда
			
			ПутьДляЗаписиФайлаНастроек = Константы.ПутьКОбщемуКаталогуСУ.Получить();
			ПутьДляЗаписиФайлаНастроек = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьДляЗаписиФайлаНастроек);
			ПутьДляЗаписиФайлаНастроек = ПутьДляЗаписиФайлаНастроек + ВебКабинетСУ.ИмяФайлаНастроек(Перечисления.РедакцииВебКабинетаСУ.Редакция20);		
			
			Публикация20Объект = Публикация20.ПолучитьОбъект();
			Для каждого ИмяНастройки30 Из НастройкиТолькоВРедакции30 Цикл
				Публикация20Объект[ИмяНастройки30] = ЭтотОбъект[ИмяНастройки30];
			КонецЦикла;
			
			Справочники.ПубликацииВебКабинетаСУ.СформироватьФайлНастроек(Публикация20Объект,,ПутьДляЗаписиФайлаНастроек);
			
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
